<template>
  <article class="terms">
    <h1 class="title-page">利用規約</h1>
    <section class="section">
      <p class="text">
        この利用規約(以下、「本規約」といいます)は、ざっくりAWS(以下、「本サービス」といいます)の利用条件を定めるものです。<br />ユーザーの皆さま(以下、「ユーザー」といいます)には、本規約に従って、本サービスをご利用いただきます。
      </p>
      <section>
        <h2 class="title-small">第1条(適用)</h2>
        <p class="text">
          本規約は、本サービスの利用に関わるすべてのユーザーに適用されるものとします。
        </p>
      </section>
      <section>
        <h2 class="title-small">第2条(禁止事項)</h2>
        <p class="text">ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。</p>
        <ol>
          <li>法令または公序良俗に違反する行為</li>
          <li>犯罪行為に関連する行為</li>
          <li>サーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
          <li>サービスの運営を妨害するおそれのある行為</li>
          <li>サービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
          <li>その他、不適切と判断する行為</li>
        </ol>
      </section>
      <section>
        <h2 class="title-small">第3条(本サービスの提供の停止等)</h2>
        <p class="text">
          以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害について、理由を問わず一切の責任を負わないものとします。
        </p>
        <ol>
          <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
          <li>地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合</li>
          <li>コンピュータまたは通信回線等が事故により停止した場合</li>
          <li>その他、本サービスの提供が困難と判断した場合</li>
        </ol>
      </section>
      <section>
        <h2 class="title-small">第4条(免責事項)</h2>
        <ol>
          <li>
            本サービスが算出するAWSの料金は、無駄を省いたざっくりとした目安になるため、実際の料金が想定よりも高かった場合にも、一切責任を負いません。
          </li>
          <li>
            本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。
          </li>
        </ol>
      </section>
      <section>
        <h2 class="title-small">第5条(サービス内容の変更等)</h2>
        <p class="text">
          本サービスは、ユーザーに通知することなく、サービス内容を変更しまたは本サービスの提供を中止することができるものとし、これによってユーザーに生じた損害について一切の責任を負いません。
        </p>
      </section>
      <section>
        <h2 class="title-small">第6条(利用規約の変更)</h2>
        <p class="text">
          必要と判断した場合には、ユーザーに通知することなくいつでも本規約を変更することができるものとします。
        </p>
      </section>
      <section>
        <h2 class="title-small">第7条(一般条項)</h2>
        <p class="text">
          本規約の解釈にあたっては、日本法を準拠法とします。
        </p>
      </section>
    </section>
  </article>
</template>

<script>
import meta from '@/config/meta'

export default {
  name: 'TermsIndex',
  head() {
    return meta.terms
  }
}
</script>
